BPI-SINOVOIP/BPI-R2-bsp/phoenix/system/src/drivers/wifi/rtl8723du/hal/rtl8723d/usb/usb_halinit.c
	/*
	 * 2010/08/23 MH According to Alfred's suggestion, we need to to prevent HW
	 * to enter suspend mode automatically. Otherwise, it will shut down major power
	 * domain and 8051 will stop. When we try to enter selective suspend mode, we
	 * need to prevent HW to enter D2 mode aumotmatically. Another way, Host will
	 * issue a S10 signal to power domain. Then it will cleat SIC setting(from Yngli).
	 * We need to enable HW suspend mode when enter S3/S4 or disable. We need
	 * to disable HW suspend mode for IPS/radio_off.
	 */
	if (Type == _FALSE) {
		reg |= BIT(14);
		rtw_write16(padapter, REG_GPIO_MUXCFG, reg);
		reg |= BIT(12);
		rtw_write16(padapter, REG_GPIO_MUXCFG, reg);
	} else {
		reg &= (~BIT(12));
		rtw_write16(padapter, REG_GPIO_MUXCFG, reg);
		reg &= (~BIT(14));
		rtw_write16(padapter, REG_GPIO_MUXCFG, reg);
	}

}   /* HwSuspendModeEnable */

rt_rf_power_state RfOnOffDetect(IN PADAPTER padapter)
{
	/* HAL_DATA_TYPE *pHalData = GET_HAL_DATA(padapter); */
	u8 val8;
	rt_rf_power_state rfpowerstate = rf_off;

	if (adapter_to_pwrctl(padapter)->bHWPowerdown) {
		val8 = rtw_read8(padapter, REG_HSISR);
		RTW_INFO("pwrdown, 0x5c(BIT(7))=%02x\n", val8);
		rfpowerstate = (val8 & BIT(7)) ? rf_off : rf_on;
	} else { /* rf on/off */
		rtw_write8(padapter, REG_MAC_PINMUX_CFG, rtw_read8(padapter, REG_MAC_PINMUX_CFG) & ~(BIT(3)));
		val8 = rtw_read8(padapter, REG_GPIO_IO_SEL);
		RTW_INFO("GPIO_IN=%02x\n", val8);
		rfpowerstate = (val8 & BIT(3)) ? rf_on : rf_off;
	}
	return rfpowerstate;
}   /* HalDetectPwrDownMode */

void _InitBBRegBackup_8723du(PADAPTER padapter)
{
	HAL_DATA_TYPE *pHalData = GET_HAL_DATA(padapter);

	/* For Channel 1~11 (Default Value)*/
	pHalData->RegForRecover[0].offset = rCCK0_TxFilter2;
	pHalData->RegForRecover[0].value =
		PHY_QueryBBReg(padapter,
			       pHalData->RegForRecover[0].offset, bMaskDWord);

	pHalData->RegForRecover[1].offset = rCCK0_DebugPort;
	pHalData->RegForRecover[1].value =
		PHY_QueryBBReg(padapter,
			       pHalData->RegForRecover[1].offset, bMaskDWord);

	pHalData->RegForRecover[2].offset = 0xAAC;
	pHalData->RegForRecover[2].value =
		PHY_QueryBBReg(padapter,
			       pHalData->RegForRecover[2].offset, bMaskDWord);
#if 0
	/* For 20 MHz	(Default Value)*/
	pHalData->RegForRecover[2].offset = rBBrx_DFIR;
	pHalData->RegForRecover[2].value = PHY_QueryBBReg(padapter, pHalData->RegForRecover[2].offset, bMaskDWord);

	pHalData->RegForRecover[3].offset = rOFDM0_XATxAFE;
	pHalData->RegForRecover[3].value = PHY_QueryBBReg(padapter, pHalData->RegForRecover[3].offset, bMaskDWord);

	pHalData->RegForRecover[4].offset = 0x1E;
	pHalData->RegForRecover[4].value = PHY_QueryRFReg(padapter, ODM_RF_PATH_A, pHalData->RegForRecover[4].offset, bRFRegOffsetMask);
#endif
}

u32 rtl8723du_hal_init(PADAPTER padapter)
{
	u8 value8 = 0, u1bRegCR;
	u32 status = _SUCCESS;
	HAL_DATA_TYPE *pHalData = GET_HAL_DATA(padapter);
	struct pwrctrl_priv *pwrctrlpriv = adapter_to_pwrctl(padapter);
	struct registry_priv *pregistrypriv = &padapter->registrypriv;
	rt_rf_power_state eRfPowerStateToSet;
	u32 NavUpper = WiFiNavUpperUs;
	u32 value32;
	u32 init_start_time = rtw_get_current_time();


	/* if (rtw_is_surprise_removed(padapter)) */
	/*	return RT_STATUS_FAILURE; */

	/* Check if MAC has already power on. */
	/* set usb timeout to fix read mac register fail before power on */
	rtw_write8(padapter, 0xFE4C /*REG_USB_ACCESS_TIMEOUT*/, 0x80);
	value8 = rtw_read8(padapter, REG_SYS_CLKR_8723D + 1);
	u1bRegCR = rtw_read8(padapter, REG_CR);
	RTW_INFO(" power-on :REG_SYS_CLKR 0x09=0x%02x. REG_CR 0x100=0x%02x.\n", value8, u1bRegCR);
	if ((value8 & BIT(3)) && (u1bRegCR != 0 && u1bRegCR != 0xEA))
		RTW_INFO(" MAC has already power on.\n");
	else {
		/* Set FwPSState to ALL_ON mode to prevent from the I/O be return because of 32k */
		/* state which is set before sleep under wowlan mode. 2012.01.04. by tynli. */
		RTW_INFO(" MAC has not been powered on yet.\n");
	}

#ifdef CONFIG_WOWLAN
	if (rtw_read8(padapter, REG_MCUFWDL) & BIT(7) &&
	    (pwrctrlpriv->wowlan_wake_reason & FW_DECISION_DISCONNECT)) {
		u8 reg_val = 0;

		RTW_INFO("+Reset Entry+\n");
		rtw_write8(padapter, REG_MCUFWDL, 0x00);
		_8051Reset8723(padapter);
		/* reset BB */
		reg_val = rtw_read8(padapter, REG_SYS_FUNC_EN);
		reg_val &= ~(BIT(0) | BIT(1));
		rtw_write8(padapter, REG_SYS_FUNC_EN, reg_val);
		/* reset RF */
		rtw_write8(padapter, REG_RF_CTRL, 0);
		/* reset TRX path */
		rtw_write16(padapter, REG_CR, 0);
		/* reset MAC, Digital Core */
		reg_val = rtw_read8(padapter, REG_SYS_FUNC_EN + 1);
		reg_val &= ~(BIT(4) | BIT(7));
		rtw_write8(padapter, REG_SYS_FUNC_EN + 1, reg_val);
		reg_val = rtw_read8(padapter, REG_SYS_FUNC_EN + 1);
		reg_val |= BIT(4) | BIT(7);
		rtw_write8(padapter, REG_SYS_FUNC_EN + 1, reg_val);
		RTW_INFO("-Reset Entry-\n");
	}
#endif /* CONFIG_WOWLAN */

	status = rtw_hal_power_on(padapter);
	if (status == _FAIL) {
		goto exit;
	}

	status = rtl8723d_InitLLTTable(padapter);
	if (status == _FAIL) {
		goto exit;
	}

	if (pHalData->bRDGEnable)
		_InitRDGSetting_8723du(padapter);


	/* Enable TX Report */
	/* Enable Tx Report Timer */
	value8 = rtw_read8(padapter, REG_TX_RPT_CTRL);
	rtw_write8(padapter, REG_TX_RPT_CTRL, value8 | BIT(1));
	/* Set MAX RPT MACID */
	rtw_write8(padapter, REG_TX_RPT_CTRL + 1, 2);
	/* Tx RPT Timer. Unit: 32us */
	rtw_write16(padapter, REG_TX_RPT_TIME, 0xCdf0);
#ifdef CONFIG_TX_EARLY_MODE
	if (pHalData->AMPDUBurstMode) {

		value8 = rtw_read8(padapter, REG_EARLY_MODE_CONTROL_8723D);
#if RTL8723D_EARLY_MODE_PKT_NUM_10 == 1
		value8 = value8 | 0x1f;
#else
		value8 = value8 | 0xf;
#endif
		rtw_write8(padapter, REG_EARLY_MODE_CONTROL_8723D, value8);

		rtw_write8(padapter, REG_EARLY_MODE_CONTROL_8723D + 3, 0x80);

		value8 = rtw_read8(padapter, REG_TCR_8723D + 1);
		value8 = value8 | 0x40;
		rtw_write8(padapter, REG_TCR_8723D + 1, value8);
	} else
#endif
		rtw_write8(padapter, REG_EARLY_MODE_CONTROL_8723D, 0);

	/* <Kordan> InitHalDm should be put ahead of FirmwareDownload. (HWConfig flow: FW->MAC->-BB->RF) */
	/* rtl8723d_InitHalDm(padapter); */

	if (padapter->registrypriv.mp_mode == 0
		#if defined(CONFIG_MP_INCLUDED) && defined(CONFIG_RTW_CUSTOMER_STR)
		|| padapter->registrypriv.mp_customer_str
		#endif
	) {
		status = rtl8723d_FirmwareDownload(padapter, _FALSE);
		if (status != _SUCCESS) {
			padapter->bFWReady = _FALSE;
			pHalData->fw_ractrl = _FALSE;
			goto exit;
		} else {
			padapter->bFWReady = _TRUE;
			pHalData->fw_ractrl = _TRUE;
		}
	}

	if (pwrctrlpriv->reg_rfoff == _TRUE)
		pwrctrlpriv->rf_pwrstate = rf_off;

	/* Set RF type for BB/RF configuration */
	_InitRFType(padapter);

	HalDetectPwrDownMode(padapter);

	/* We should call the function before MAC/BB configuration. */
	PHY_InitAntennaSelection8723D(padapter);


#if (DISABLE_BB_RF == 1)
	/* fpga verification to open phy */
	rtw_write8(padapter, REG_SYS_FUNC_EN_8723D, FEN_USBA | FEN_USBD | FEN_BB_GLB_RSTn | FEN_BBRSTB);
#endif

#if (HAL_MAC_ENABLE == 1)
	status = PHY_MACConfig8723D(padapter);
	if (status == _FAIL) {
		RTW_INFO("PHY_MACConfig8723D fault !!\n");
		goto exit;
	}
#endif

	/* d. Initialize BB related configurations. */
#if (HAL_BB_ENABLE == 1)
	status = PHY_BBConfig8723D(padapter);
	if (status == _FAIL) {
		RTW_INFO("PHY_BBConfig8723D fault !!\n");
		goto exit;
	}
#endif

#if (HAL_RF_ENABLE == 1)
	status = PHY_RFConfig8723D(padapter);

