BPI-SINOVOIP/BPI-R2-bsp/phoenix/system/src/drivers/wifi/rtl8723du/hal/rtl8723d/usb/usb_halinit.c
	rtl8723d_set_hal_ops(pHalFunc);

	pHalFunc->hal_power_on = &_InitPowerOn_8723du;
	pHalFunc->hal_power_off = &CardDisableRTL8723du;

	pHalFunc->hal_init = &rtl8723du_hal_init;
	pHalFunc->hal_deinit = &rtl8723du_hal_deinit;

	pHalFunc->inirp_init = &rtl8723du_inirp_init;
	pHalFunc->inirp_deinit = &rtl8723du_inirp_deinit;

	pHalFunc->init_xmit_priv = &rtl8723du_init_xmit_priv;
	pHalFunc->free_xmit_priv = &rtl8723du_free_xmit_priv;

	pHalFunc->init_recv_priv = &rtl8723du_init_recv_priv;
	pHalFunc->free_recv_priv = &rtl8723du_free_recv_priv;

#ifdef CONFIG_SW_LED
	pHalFunc->InitSwLeds = &rtl8723du_InitSwLeds;
	pHalFunc->DeInitSwLeds = &rtl8723du_DeInitSwLeds;
#else /*case of hw led or no led */
	pHalFunc->InitSwLeds = NULL;
	pHalFunc->DeInitSwLeds = NULL;
#endif/*CONFIG_SW_LED */

	pHalFunc->init_default_value = &rtl8723d_init_default_value;
	pHalFunc->intf_chip_configure = &rtl8723du_interface_configure;
	pHalFunc->read_adapter_info = &rtl8723du_read_adapter_info;

	pHalFunc->SetHwRegHandler = &SetHwReg8723du;
	pHalFunc->GetHwRegHandler = &GetHwReg8723du;
	pHalFunc->GetHalDefVarHandler = &GetHalDefVar8723du;
	pHalFunc->SetHalDefVarHandler = &SetHalDefVar8723du;

	pHalFunc->hal_xmit = &rtl8723du_hal_xmit;
	pHalFunc->mgnt_xmit = &rtl8723du_mgnt_xmit;
	pHalFunc->hal_xmitframe_enqueue = &rtl8723du_hal_xmitframe_enqueue;

#ifdef CONFIG_HOSTAPD_MLME
	pHalFunc->hostap_mgnt_xmit_entry = &rtl8723du_hostap_mgnt_xmit_entry;
#endif
	pHalFunc->interface_ps_func = &rtl8723du_ps_func;

#ifdef CONFIG_XMIT_THREAD_MODE
	pHalFunc->xmit_thread_handler = &rtl8723du_xmit_buf_handler;
#endif
#ifdef CONFIG_SUPPORT_USB_INT
	pHalFunc->interrupt_handler = &rtl8723du_interrupt_handler;
#endif

}
